import styles from './Contacts.module.scss';

const Contacts = () => {
  return (
    <div className={styles.container}>
      <div className={styles.info__block}>
        <h2>Контакти</h2>
        <p>Співпраця: ojoycoop@gmail.com</p>
        <p>Питання та пропозиції: ojoy@gmail.com</p>
      </div>
      <div className={styles.info__block}>
        <h2>Вакансії</h2>
        <p>Ми шукаємо талановитого та пристрасного актора озвучки для нашої студії озвучення аніме. Наша мета - надати
          українським глядачам неперевершений досвід перегляду анімаційного контенту, і ми шукаємо актора з вміннями,
          які відповідають високим стандартам озвучення.
        </p>
        <div className={styles.requirements}>
          <h4>Вимоги:</h4>
          <ol className={styles.list}>
            <li>
              Любите аніме
            </li>
            <li> Маєте досвід роботи в галузі озвучення або акторського мистецтва. Знання процесу озвучення та роботи в
              звукозаписному студії будуть великим плюсом.
            </li>
            <li>Експресія та акторські здібності: Ви вмієте передати емоції та особливості персонажів через свій голос.
              Здатність акторського ігрового виконання та створення характеру персонажа є важливою.
            </li>
            <li> Креативність: Ви маєте здатність вносити свій власний творчий внесок та ідеї в процес озвучення, щоб
              створити унікальний та якісний контент.
            </li>
          </ol>
        </div>
      </div>
    </div>
  );
};

export default Contacts;
